Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Notice how in the response we have retrieved the `name` and `surname` of the created Hero. This is because we selected to retrieve these fields in the response within the `{ }` in the mutation query. This can easily be a server side generated field that the client may require.
ja_jp: レスポンスの中で、作成したヒーローの `name` と `surname` を取得していることに注目してください。これは mutation クエリの `{ }` の中で、これらのフィールドをレスポンスで取得することを選択したためです。これは、クライアントが必要とするサーバー側で生成されたフィールドである可能性があります。

source: Notice how we have excluded the value in the `@Query` annotation. Therefore, the name of the query is implicitly set as the method name excluding the `get`.
ja_jp: `@Query` のアノテーションで値を除外していることに注目してください。したがって、クエリの名前は、 `get` を除いたメソッド名が暗黙的に設定されます。

source: Notice in the response we have only retrieved the required fields. Therefore, we have prevented `Over-fetching`.
ja_jp: レスポンスでは、必要なフィールドのみを取得していることに注意してください。そのため、 `Over-fetching` を防ぐことができました。

source: Notice that `Ally` has a some of the same fields as a `Hero`. To better make queries easier for clients, let's create an abstraction for any character.
ja_jp: `Ally` は `Hero` と同じフィールドをいくつか持っていることに注目してください。 クライアントがクエリーをより簡単に行えるように、任意のキャラクターに対する抽象化を作成しましょう。

source: Notice that both microservices indicated that they received the completion callback.
ja_jp: 両方のマイクロサービスが、完了コールバックを受け取ったことを示していることに注目してください。

source: Notice that explicit annotations such as `@RolesAllowed` are not defined to enforce access control for the resources. Instead, the `keycloak-authorization` extension dynamically maps the URIs of protected resources in Keycloak.
ja_jp: リソースへのアクセス制御を強制するために、 `@RolesAllowed` などの明示的なアノテーションが定義されていない点に注意してください。 代わりに、 `keycloak-authorization` エクステンションは、Keycloak 内の保護されたリソースの URI を動的にマッピングします。

source: Notice that object updates can be composed which means that updates to multiple objects can be committed together as a single action. [Note that it is also possible to begin nested transactions so that you can perform speculative work which may then be abandoned without abandoning other work performed by the outer transaction].
ja_jp: また、オブジェクトの更新を構成することが可能です。つまり、複数のオブジェクトの更新を 1 つのアクションとしてまとめてコミットすることができます。[なお、ネストしたトランザクションを開始することで、推論的な作業を行うことも可能です。これは、その後、外側のトランザクションで行われた他の作業を放棄することなく、破棄できます。

source: Notice that thanks to Mutiny support for context propagation, this works out of the box. The 3 items are persisted using the same transaction and this transaction is committed when the stream completes.
ja_jp: コンテキストの伝播のための Mutiny サポートのおかげで、これは、そのまま直ぐに動作することに注目してください。3つのアイテムは同じトランザクションを使用して保持され、このトランザクションはストリームが完了するとコミットされます。

source: Notice that the `completeWork` method was invoked.
ja_jp: `completeWork` メソッドが呼び出されたことに注目してください。

source: Notice that the current username does not get returned. To learn more about why this behavior occurs, you can use OIDC Dev UI as explained in the xref:security-openid-connect-dev-services.adoc#dev-ui-all-oidc-providers[Dev UI for all OpenID Connect Providers] section of the "Dev Services and UI for OpenID Connect (OIDC)" guide and the following section.
ja_jp: 現行のユーザー名は返されないことに注意してください。 この動作が発生する理由は、"OpenID Connect (OIDC) の開発サービスと UI" ガイドの xref:security-openid-connect-dev-services.adoc#dev-ui-all-oidc-providers[すべての OpenID Connect プロバイダーの Dev UI] セクションと次のセクションで説明されているとおり、OIDC Dev UI を使用して確認できます。

source: Notice that there is no JFR specific code included in the application. By default, requests sent to this endpoint will be recorded into JFR without any required code changes.
ja_jp: アプリケーションには JFR 固有のコードが含まれていないことに注意してください。デフォルトでは、このエンドポイントに送信されるリクエストは、 コードを変更することなく JFR に記録されます。

source: Notice that there is no tracing specific code included in the application. By default, requests sent to this endpoint will be traced without any code changes being required. It is also possible to enhance the tracing information. This can be achieved by https://github.com/smallrye/smallrye-opentracing/[SmallRye OpenTracing] an implementation of https://github.com/eclipse/microprofile-opentracing/[MicroProfile OpenTracing].
ja_jp: このアプリケーションにはトレース用のコードが含まれていないことに注意してください。デフォルトでは、このエンドポイントに送信されたリクエストは、コードを変更することなくトレースされます。トレース情報を拡張することも可能です。これは、 link:https://github.com/eclipse/microprofile-opentracing/[MicroProfile OpenTracing] の実装である link:https://github.com/smallrye/smallrye-opentracing/[SmallRye OpenTracing] で実現できます。

source: Notice that there is no tracing specific code included in the application. By default, requests sent to this endpoint will be traced without any required code changes.
ja_jp: このアプリケーションには、トレースのためのコードが含まれていないことに注意してください。デフォルトでは、 このエンドポイントに送信されたリクエストは、コードの変更を必要とせずにトレースされます。

source: Notice that there is one measured value for each unique combination of `example_prime_number_total` and `type` value.
ja_jp: `example_prime_number_total` と `type` の値の一意の組合せごとに 1 つの測定値があることに注意してください。

source: Notice that your application assigned all four lessons to one of the two time slots and one of the two rooms. Also notice that it conforms to all hard constraints. For example, M. Curie's two lessons are in different time slots.
ja_jp: アプリケーションが 4 つのレッスンすべてを 2 つのタイムスロットのいずれか 1 つと、2 つの教室のいずれか 1 つに割り当てていることに注意してください。また、すべてのハード制約に準拠していることにも注意してください。たとえば、M. Curie の 2 つのレッスンは異なるタイムスロットにあります。

source: Notice the `System.out` messages indicating that the `@Complete` callback was invoked. Now kill the java process in preparation for the next step (the process id was printed on the console, in my example the pid is 2389948, so I typed `kill 2389948`).
ja_jp: `@Complete` のコールバックが呼び出されたことを示す `System.out` のメッセージに注目してください。ここで、次のステップに備えてjavaプロセスをkillします（プロセスIDがコンソールに表示され、私の例ではpidが2389948なので、 `kill 2389948` と入力しました）。

source: Notice the `toString()` method keeps the output short, so it is easier to read OptaPlanner's `DEBUG` or `TRACE` log, as shown later.
ja_jp: `toString()` メソッドは出力を短く保つため、後で示すように、OptaPlanner の `DEBUG` または `TRACE` のログは読みやすくなっています。

source: Notice the use of `@pom` in the first line; that instructs jbang to load the pom for the platform and use it for version management and the other dependency versions can be left out.
ja_jp: 最初の行で `@pom` を使用していることに注意してください。これは jbang にプラットフォーム用の pom をロードしてバージョン管理に使用するように指示しており、他のバージョン指定をしないで済むようになります。

source: Notice there is an extra bit in the key. The syntax is as follows: `quarkus.datasource.[optional name.][datasource property]`.
ja_jp: キーに余分なビットがあることに注意してください。構文は以下の通りです。 `quarkus.datasource.[optional name.][datasource property]` .

source: Notice there is an extra section in the configuration property. The syntax is as follows: `quarkus.datasource.[optional name.][datasource property]`.
ja_jp: 設定プロパティーに余分なセクションがあることに注意してください。 構文は次の通りです: `quarkus.datasource.[optional name.][datasource property]` .

source: Notice there's an extra bit in the key (the `second` segment). The syntax is as follows: `quarkus.redis.[optional name.][redis configuration property]`. If the name is omitted, it configures the default client.
ja_jp: キー ( `second` セグメント) に余分なビットがあることに注意してください。構文は次の通りです: `quarkus.redis.[optional name.][redis configuration property]` .名前を省略した場合、デフォルトのクライアントを設定します。

source: Notice there's an extra bit in the key (the `users` and `inventory` segments). The syntax is as follows: `quarkus.mongodb.[optional name.][mongo connection property]`. If the name is omitted, it configures the default client.
ja_jp: キーに余分なビットがあることに注意してください ( `users` と `inventory` のセグメント)。構文は以下の通りです。 `quarkus.mongodb.[optional name.][mongo connection property]` .名前を省略すると、デフォルトのクライアントを設定します。

source: Notice there's an extra bit in the key. The syntax is as follows: `quarkus.flyway.[optional name.][datasource property]`.
ja_jp: キーに余分なビットがあることに注意してください。構文は次の通りです。 `quarkus.flyway.[optional name.][datasource property]`

source: Notice there's an extra bit in the key. The syntax is as follows: `quarkus.liquibase.[optional name.][datasource property]`.
ja_jp: キーに余分なビットがあることに注意してください。構文は以下の通りです。 `quarkus.liquibase.[optional name.][datasource property]` .

source: Now add the following configuration to your `application.properties`:
ja_jp: 次に、以下の設定を `application.properties` に追加します。

source: Now all methods and classes carrying `@HrTenant` will be authenticated using the OIDC provider configured by `quarkus.oidc.hr.auth-server-url`, while all other classes and methods will still be authenticated using the default OIDC provider.
ja_jp: これで、 `@HrTenant` を運ぶすべてのメソッドとクラスは、 `quarkus.oidc.hr.auth-server-url` によって設定された OIDC プロバイダーを使用して認証されますが、他のすべてのクラスとメソッドは、デフォルトの OIDC プロバイダーを使用して認証されます。

source: Now all you have to do is implement the recorder in your extension's xref:building-my-first-extension.adoc#description-of-a-quarkus-extension[`runtime module`]:
ja_jp: あとは、エクステンションの xref:building-my-first-extension.adoc#description-of-a-quarkus-extension[`runtime module`] でレコーダーを実装するだけです:

source: Now any `Template` attribute will show the option to generate a corresponding Qute template, or navigate to the existing template file.
ja_jp: これで、どの `Template` 属性にも、対応する Qute テンプレートを生成するか、既存のテンプレート・ファイルに移動するかのオプションが表示されるようになりました。

source: Now applications need to import only the relevant BOMs, which avoids enforcing dependency constraints from the rest of the "universe".
ja_jp: これにより、アプリケーションは関連するBOMのみをインポートする必要があり、残りの"universe"からの依存性制約を強いることがなくなります。

source: Now build it and run it in the background:
ja_jp: 次にそれをビルドして、バックグラウンドで実行します。

source: Now choose your application type. For this guide choose `Consumer` and click `Next` until you reach the screen below. Now enter an application name, and contact email, and press `Create app`:
ja_jp: 次に、アプリケーションの種類を選択します。このガイドでは、 `Consumer` を選択し、下の画面が表示されるまで `Next` をクリックします。次に、アプリケーション名と連絡先のメールアドレスを入力し、 `Create app` を押します。

source: Now clear the browser cache, access http://localhost:8080/hello and finally the user name is returned.
ja_jp: 次にブラウザーのキャッシュをクリアして http://localhost:8080/hello にアクセスすると、ユーザー名が返されます。

source: Now click on `Register application` and you'll be shown your application page:
ja_jp: 次に、 `Register application` をクリックすると、アプリケーションページが表示されます。

source: Now create a `org.acme.elasticsearch.FruitService` that will be the business layer of our application and will store/load the fruits from the Elasticsearch instance. Here we use the low level REST client, if you want to use the Java API client instead, follow the instructions in the <<using-the-elasticsearch-java-client,Using the Elasticsearch Java Client>> paragraph instead.
ja_jp: アプリケーションのビジネスレイヤーとなる `org.acme.elasticsearch.FruitService` を作成し、Elasticsearch インスタンスからフルーツを保存/ロードします。 ここでは低レベルの REST クライアントを使用しています。 代わりに Java API クライアントを使用したい場合は、代わりに xref:using-the-elasticsearch-java-client[Elasticsearch Java クライアントを使用する] のセクションの指示に従ってください。

source: Now create a `org.acme.elasticsearch.FruitService` that will be the business layer of our application and will store/load the fruits from the Elasticsearch instance. Here we use the low level REST client, if you want to use the Java API client instead, follow the instructions in the xref:using-the-elasticsearch-java-client[Using the Elasticsearch Java Client] paragraph instead.
ja_jp: アプリケーションのビジネスレイヤーとなる `org.acme.elasticsearch.FruitService` を作成し、Elasticsearch インスタンスからフルーツを保存/ロードするようにします。ここでは低レベルの REST クライアントを使用していますが、代わりに Java API クライアントを使用したい場合は、代わりに xref:using-the-elasticsearch-java-client[Elasticsearch Java クライアントの使用] のパラグラフの指示に従ってください。

source: Now create a `org.acme.elasticsearch.FruitService` that will be the business layer of our application and store/load the fruits from the Elasticsearch instance. Here we use the low level client, if you want to use the high level client instead follow the instructions in the <<using-the-high-level-rest-client,Using the High Level REST Client>> paragraph instead.
ja_jp: ここで、アプリケーションのビジネスレイヤーとなる `org.acme.elasticsearch.FruitService` を作成し、Elasticsearch インスタンスからフルーツを保存/ロードします。ここでは低レベルのクライアントを使用していますが、代わりに高レベルのクライアントを使用したい場合は、 <<高レベルrestクライアントの使用,高レベルのRESTクライアントの使用>> の項の指示に従ってください。

source: Now create a `org.acme.mongodb.FruitService` that will be the business layer of our application and store/load the fruits from the mongoDB database.
ja_jp: 今、私たちのアプリケーションのビジネス層となる `org.acme.mongodb.FruitService` を作成し、mongoDB データベースからフルーツを保存/ロードします。

source: Now create a new REST resource class called *ParticleResource.java* where we return some test particles (neglecting any atomic physics implications here).
ja_jp: ここで、 *ParticleResource.java* という新しいRESTリソースクラスを作成し、いくつかのテストパーティクルを返します（ここでは原子物理学的な意味合いは無視します）。

source: Now create an environment variable named `QUARKUS_MODE` and with value set to "native":
ja_jp: ここで、 `QUARKUS_MODE` という名前の環境変数を作成し、値を"native"に設定します:

source: Now create the Docker instance on ACI pointing to your image on ACR:
ja_jp: ACR上のイメージを指すACI上にDockerインスタンスを作成します。

source: Now during build the `quarkus.swagger-ui.always-include` will be generated into the resulting jar and `http://0.0.0.0:8080/q/swagger-ui` will be available when run.
ja_jp: これでビルド中に `quarkus.swagger-ui.always-include` が生成され、結果の jar と実行時に `http://0.0.0.0:8080/q/swagger-ui` が利用可能になります。

source: Now end the LRA in a different method:
ja_jp: 今度は別の方法でLRAを終了します。

source: Now enter an application name, and contact email, and press `Create app`:
ja_jp: 次に、アプリケーション名と連絡先のメールアドレスを入力し、 `Create app` を押します。

source: Now enter an application name, and press `Next`:
ja_jp: 次に、アプリケーション名を入力して、 `Next` を押します。

source: Now every time you refresh the browser you should see any changes you have made locally immediately visible in the remote app.
ja_jp: これでブラウザを更新するたびに、ローカルで行った変更がリモートアプリにすぐに表示されるようになりました。

source: Now every time you refresh the browser you should see any changes you have made locally immediately visible in the remote app. This is done via a HTTP based long polling transport, that will synchronize your local workspace and the remote application via HTTP calls.
ja_jp: これで、ブラウザを更新するたびに、ローカルで行った変更がリモート アプリに即座に表示されるようになりました。これは、HTTPベースのロングポーリングトランスポートを介して行われ、HTTPコールを介してローカルのワークスペースとリモートアプリケーションを同期させます。

source: Now every time you refresh the browser you should see any changes you have made locally immediately visible in the remote app. This is done via an HTTP based long polling transport, that will synchronize your local workspace and the remote application via HTTP calls.
ja_jp: これで、ブラウザーを更新するたびに、ローカルで行った変更がリモートアプリですぐに表示されるようになります。これは、HTTP ベースのロングポーリングトランスポートを介して行われ、HTTP 呼び出しを介してローカルワークスペースとリモートアプリケーションを同期します。

source: Now generate the token again and run:
ja_jp: 次に、トークンを再度生成して実行します。

source: Now go to `Settings > Basic` on the left-hand menu, and write down your `App ID` and `App secret`:
ja_jp: 次に、左側のメニューの `Settings > Basic` に移動し、 `App ID` と `App secret` を書き留めます。

source: Now is a good time for extensions to start moving, so they can take advantage of the more concise programming model and reduced resource usage. This will also resolve some deprecation warnings triggered by the old model. Be aware that extensions which have moved to the new API will no longer work with old versions of Quarkus. 3.25 would be the minimum possible version, and we would recommend setting 3.27 or 3.28 as the minimum version (more on that below).
ja_jp: 現在は、より簡潔なプログラミングモデルとリソース使用量の削減という利点を享受するために、エクステンションの移行を開始するのに良い時期です。これにより、古いモデルによって引き起こされるいくつかの非推奨警告も解決されます。新しい API に移行したエクステンションは、古いバージョンの Quarkus では動作しなくなることに注意してください。3.25 が可能な最小バージョンとなりますが、最小バージョンとして 3.27 または 3.28 を設定することをお勧めします (詳細は後述)。

source: Now let us add a simple web page to interact with our `FruitResource`. Quarkus automatically serves static resources located under the `META-INF/resources` directory. In the `src/main/resources/META-INF/resources` directory, add a `fruits.html` file with the content from this link:{quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html] file in it.
ja_jp: それでは、`FruitResource` とやり取りするための簡単なウェブページを追加してみましょう。 Quarkus は、`META-INF/resources` ディレクトリーの下にある静的リソースを自動的に提供します。 `src/main/resources/META-INF/resources` ディレクトリーに、この link:{quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html] ファイルのコンテンツを含む `fruits.html` ファイルを追加します。

source: Now let us replace the class with one that uses Quarkus features:
ja_jp: これを Quarkus の機能を使用するクラスに置き換えてみます。

source: Now let's add a simple web page to display our list of legumes. In the `src/main/resources/META-INF/resources` directory, add a `legumes.html` file with the content from this {quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/legumes.html[legumes.html] file in it.
ja_jp: ここで、マメ科植物のリストを表示するための簡単なウェブページを追加してみましょう。 `src/main/resources/META-INF/resources` ディレクトリーに、この {quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/legumes.html[legumes.html] ファイルの内容を含む `legumes.html` ファイルを追加します。

source: Now let's add a simple web page to interact with our `FruitResource`.
ja_jp: それでは、 `FruitResource` と対話するためのシンプルなウェブページを追加してみましょう。

source: Now let's add a simple web page to interact with our `FruitResource`. Quarkus automatically serves static resources located under the `META-INF/resources` directory. In the `src/main/resources/META-INF/resources` directory, add a `fruits.html` file with the content from this link:{quickstarts-blob-url}/mongodb-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html] file in it.
ja_jp: それでは、 `FruitResource` と対話するための簡単なWebページを追加してみましょう。 Quarkusは自動的に、 `META-INF/resources` ディレクトリの下にある静的リソースを提供します。 `src/main/resources/META-INF/resources` ディレクトリに、この link:{quickstarts-blob-url}/mongodb-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html] ファイルのコンテンツを含む `fruits.html` ファイルを追加します。

source: Now let's add a simple web page to interact with our `FruitResource`. Quarkus automatically serves static resources located under the `META-INF/resources` directory. In the `src/main/resources/META-INF/resources` directory, add a `fruits.html` file with the content from this link:{quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html] file in it.
ja_jp: それでは、 `FruitResource` とやり取りするための簡単なウェブページを追加してみましょう。 Quarkusは自動的に、 `META-INF/resources` ディレクトリの下にある静的リソースを提供します。 `src/main/resources/META-INF/resources` ディレクトリに、この link:{quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html] ファイルのコンテンツを含む `fruits.html` ファイルを追加します。

source: Now let's add a simple web page to interact with our `FruitResource`. Quarkus automatically serves static resources located under the `META-INF/resources` directory. In the `src/main/resources/META-INF/resources` directory, add a `fruits.html` file with the content from this {quickstarts-blob-url}/mongodb-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html] file in it.
ja_jp: ここで、 `FruitResource` .Quarkusと対話するための簡単なウェブページを追加してみましょう。Quarkusは、 `META-INF/resources` ディレクトリーの下にある静的なリソースを自動的に提供します。 `src/main/resources/META-INF/resources` ディレクトリーに、この {quickstarts-blob-url}/mongodb-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html]ファイルの内容を含む `fruits.html` ファイルを追加します。

source: Now let's add a simple web page to interact with our `FruitResource`. Quarkus automatically serves static resources located under the `META-INF/resources` directory. In the `src/main/resources/META-INF/resources` directory, add a `fruits.html` file with the content from this {quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html] file in it.
ja_jp: ここで、 `FruitResource` .Quarkusと対話するための簡単なウェブページを追加してみましょう。Quarkusは、 `META-INF/resources` ディレクトリーの下にある静的リソースを自動的に提供します。 `src/main/resources/META-INF/resources` ディレクトリーに、この {quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html] ファイルの内容を含む `fruits.html` ファイルを追加します。

source: Now let's add a simple web page to interact with our `LibraryResource`. Quarkus automatically serves static resources located under the `META-INF/resources` directory. In the `src/main/resources/META-INF/resources` directory, overwrite the existing `index.html` file with the content from this {quickstarts-blob-url}/hibernate-search-orm-elasticsearch-quickstart/src/main/resources/META-INF/resources/index.html[index.html] file.
ja_jp: それでは、 `LibraryResource` を操作するための簡単なWebページを追加してみましょう。Quarkusは、 `META-INF/resources` ディレクトリの下にある静的リソースを自動的に提供します。 `src/main/resources/META-INF/resources` ディレクトリで、既存の `index.html` ファイルを、この {quickstarts-blob-url}/hibernate-search-orm-elasticsearch-quickstart/src/main/resources/META-INF/resources/index.html[index.html] ファイルの内容で上書きしてください。

source: Now let's add a simple web page to interact with our `LibraryResource`. Quarkus automatically serves static resources located under the `META-INF/resources` directory. In the `src/main/resources/META-INF/resources` directory, overwrite the existing `index.html` file with the content from this {quickstarts-blob-url}/hibernate-search-standalone-elasticsearch-quickstart/src/main/resources/META-INF/resources/index.html[index.html] file.
ja_jp: それでは、 `LibraryResource` と対話するための簡単なWebページを追加してみましょう。 Quarkus は、 `META-INF/resources` ディレクトリの下にある静的リソースを自動的に提供します。 `src/main/resources/META-INF/resources` ディレクトリーで、既存の `index.html` ファイルを、この {quickstarts-blob-url}/hibernate-search-standalone-elasticsearch-quickstart/src/main/resources/META-INF/resources/index.html[index.html] ファイルの内容で上書きしてください。

source: Now let's add a simple web page to interact with our `ReactiveFruitResource`. In the `src/main/resources/META-INF/resources` directory, add a `reactive-fruits.html` file with the contents from link:https://github.com/datastax/cassandra-quarkus/blob/main/quickstart/src/main/resources/META-INF/resources/reactive-fruits.html[this file] in it.
ja_jp: 次に、`ReactiveFruitResource` と連携するための簡単なウェブページを追加しましょう。`src/main/resources/META-INF/resources` ディレクトリーに、link:https://github.com/datastax/cassandra-quarkus/blob/main/quickstart/src/main/resources/META-INF/resources/reactive-fruits.html[このファイル] の内容を持つ `reactive-fruits.html` ファイルを追加してください。

source: Now let's add a simple web page to interact with our `ReactiveFruitResource`. In the `src/main/resources/META-INF/resources` directory, add a `reactive-fruits.html` file with the contents from link:src/main/resources/META-INF/resources/reactive-fruits.html[this file] in it.
ja_jp: 次に、 `ReactiveFruitResource` と対話するための簡単な Web ページを追加しましょう。 `src/main/resources/META-INF/resources` ディレクトリーに、 link:src/main/resources/META-INF/resources/reactive-fruits.html[このファイル] の内容を含めて `reactive-fruits.html` ファイルを追加します。

source: Now let's add a suffix for a greeting for which we'll set a default value.
ja_jp: では、デフォルト値を設定する挨拶にサフィックスを追加してみましょう。

source: Now let's add the simple web page to interact with our `BookResource`. Quarkus automatically serves static resources contained in the `META-INF/resources` directory. In the `src/main/resources/META-INF/resources` directory, replace the `index.html` file with the content from this link:{quickstarts-blob-url}/validation-quickstart/src/main/resources/META-INF/resources/index.html[index.html] file in it.
ja_jp: それでは、 `BookResource` と対話するための簡単なWebページを追加してみましょう。 Quarkusは、 `META-INF/resources` ディレクトリに含まれる静的リソースを自動的に提供します。 `src/main/resources/META-INF/resources` ディレクトリで、 `index.html` ファイルをこの link:{quickstarts-blob-url}/validation-quickstart/src/main/resources/META-INF/resources/index.html[index.html] ファイルの内容で置き換えます。
